# вариант №17
#Дано целое число N (>0). Используя один цикл, найти сумму 1 + 1/(1!) + 1/(2!) +
#1/(3!) + ... + 1/(N!) (выражение N! — N-факториал — обозначает произведение всех
#целых чисел от 1 до N: N! = 1-2-.. . N). Полученное число является приближенным
#значением константы e = exp(1).

while True: # проверка типа
    try:
        N = int(input('Введите число N: '))
        if N > 0: # условие значения
            break # выход
        print('Число должно быть больше 0!')
    except ValueError: # при ошибке ввода
        print('Ошибка, введите число!')
# начальные значения суммы и факториала
suma = 1
factorial = 1

for i in range(1, N + 1): # цикл нахождния суммы
    factorial *= i # i! умножением прошлого факториала на i
    suma += 1 / factorial

print('Приближенное значение e: ', suma)
