# Вариант 17.
# Даны три переменные вещественного типа: A, B, C. Если их значения упорядочены
# по возрастанию, то удвоить их; в противном случае заменить значение каждой
# переменной на противоположное. Вывести новые значения переменных A, B, C.

try:
    A = float(input('Введите число A: '))
    B = float(input('Введите число B: '))
    C = float(input('Введите число C: '))

    if A < B < C:
        A = A*2
        B = B*2
        C = C*2
    else:
        A = -A
        B = -B
        C = -C

    print('Новые Значения: ', A, B, C)
except ValueError:
    print('Ошибка, Введите число')