# Вариант 17.
# Даны три переменные вещественного типа: A, B, C. Если их значения упорядочены
# по возрастанию, то удвоить их; в противном случае заменить значение каждой
# переменной на противоположное. Вывести новые значения переменных A, B, C.

A = input('Введите число A: ') # Ввод A
while not type(A) == float:    # проверка типа A
    try:
        A = float(A)
    except ValueError:
        print('Ошибка, введите число! ')
        A = input('Введите число: ')

B = input('Введите число B: ') # Ввод C
while not type(B) == float:    # проверка типа B
    try:
        B = float(B)
    except ValueError:
        print('Ошибка, введите число! ')
        B = input('Введите число: ')

C = input('Введите число C: ') # ввод C
while not type(C) == float:    # проверка типа C
    try:
        C = float(C)
    except ValueError:
        print('Ошибка, введите число! ')
        C = input('Введите число: ')

if A < B < C: # удвоение при возрастании
    A = A*2
    B = B*2
    C = C*2
else:         # противоположные значения
    A = -A
    B = -B
    C = -C

print('Новые Значения: ', A, B, C) # вывод результата

