# Вариант №17
#Даны положительные числа A и B (A > Б). На отрезке длины A размещено
#максимально возможное количество отрезков длины Б (без наложений). Не
#используя операции умножения и деления, найти длину незанятой части отрезка A.

while True: # проверка типа
    try:
        A = float(input('Введите длину отрезка A: '))
        B = float(input('Введите длину отрезка B: '))

        if A <= 0 and B <= 0: # числа должны быть положительными
            print('Ошибка, длины должны быть > 0!')
        elif A <= B: # условие задачи
            print('Ошибка, отрезок A должен быть > отрезка B')
        else:
            break # выход если все верно
    except ValueError: # при ошибке ввода
        print('Ошибка, Введите число!')

while A >= B: # вычитаем B из A с условием
    A -= B # A = A - B

print('Длина незанятой части: ', A)